<template>
  <div id="app" style="padding: 10px;">
    <div>
      <p>第 1 段落</p>
      <p>第 2 段落</p>
      <p>第 3 段落</p>
      <p>第 4 段落</p>
      <p>第 5 段落</p>
      <p>第 6 段落</p>
      <p>第 7 段落</p>
      <p>第 8 段落</p>
      <p>第 9 段落</p>
      <p>第 10 段落</p>
      <p>第 11 段落</p>
      <p>第 12 段落</p>
      <p>第 13 段落</p>
      <p>第 14 段落</p>
      <p>第 15 段落</p>
      <p>第 16 段落</p>
      <p>第 17 段落</p>
      <p>第 18 段落</p>
      <p>第 19 段落</p>
      <p>第 20 段落</p>
      <p>第 21 段落</p>
      <p>第 22 段落</p>
      <p>第 23 段落</p>
      <p>第 24 段落</p>
      <p>第 25 段落</p>
      <p>第 26 段落</p>
      <p>第 27 段落</p>
      <p>第 28 段落</p>
      <p>第 29 段落</p>
      <p>第 30 段落</p>
      <p>第 31 段落</p>
      <p>第 32 段落</p>
      <p>第 33 段落</p>
      <p>第 34 段落</p>
      <p>第 35 段落</p>
      <p>第 36 段落</p>
      <p>第 37 段落</p>
      <p>第 38 段落</p>
      <p>第 39 段落</p>
      <p>第 40 段落</p>
      <p>第 41 段落</p>
      <p>第 42 段落</p>
      <p>第 43 段落</p>
      <p>第 44 段落</p>
      <p>第 45 段落</p>
      <p>第 46 段落</p>
      <p>第 47 段落</p>
      <p>第 48 段落</p>
      <p>第 49 段落</p>
      <p>第 50 段落</p>
      <p>第 51 段落</p>
      <p>第 52 段落</p>
      <p>第 53 段落</p>
      <p>第 54 段落</p>
      <p>第 55 段落</p>
      <p>第 56 段落</p>
      <p>第 57 段落</p>
      <p>第 58 段落</p>
      <p>第 59 段落</p>
      <p>第 60 段落</p>
      <p>第 61 段落</p>
      <p>第 62 段落</p>
      <p>第 63 段落</p>
      <p>第 64 段落</p>
      <p>第 65 段落</p>
      <p>第 66 段落</p>
      <p>第 67 段落</p>
      <p>第 68 段落</p>
      <p>第 69 段落</p>
      <p>第 70 段落</p>
      <p>第 71 段落</p>
      <p>第 72 段落</p>
      <p>第 73 段落</p>
      <p>第 74 段落</p>
      <p>第 75 段落</p>
      <p>第 76 段落</p>
      <p>第 77 段落</p>
      <p>第 78 段落</p>
      <p>第 79 段落</p>
      <p>第 80 段落</p>
      <p>第 81 段落</p>
      <p>第 82 段落</p>
      <p>第 83 段落</p>
      <p>第 84 段落</p>
      <p>第 85 段落</p>
      <p>第 86 段落</p>
      <p>第 87 段落</p>
      <p>第 88 段落</p>
      <p>第 89 段落</p>
      <p>第 90 段落</p>
      <p>第 91 段落</p>
      <p>第 92 段落</p>
      <p>第 93 段落</p>
      <p>第 94 段落</p>
      <p>第 95 段落</p>
      <p>第 96 段落</p>
      <p>第 97 段落</p>
      <p>第 98 段落</p>
      <p>第 99 段落</p>
      <p>第 100 段落</p>
    </div>
    <f-sticky style="border: 10px solid red;">
      <span>sticky hahahahahahahahahahahahaha</span>
    </f-sticky>
    <div>
      <p>第 1 段落</p>
      <p>第 2 段落</p>
      <p>第 3 段落</p>
      <p>第 4 段落</p>
      <p>第 5 段落</p>
      <p>第 6 段落</p>
      <p>第 7 段落</p>
      <p>第 8 段落</p>
      <p>第 9 段落</p>
      <p>第 10 段落</p>
      <p>第 11 段落</p>
      <p>第 12 段落</p>
      <p>第 13 段落</p>
      <p>第 14 段落</p>
      <p>第 15 段落</p>
      <p>第 16 段落</p>
      <p>第 17 段落</p>
      <p>第 18 段落</p>
      <p>第 19 段落</p>
      <p>第 20 段落</p>
      <p>第 21 段落</p>
      <p>第 22 段落</p>
      <p>第 23 段落</p>
      <p>第 24 段落</p>
      <p>第 25 段落</p>
      <p>第 26 段落</p>
      <p>第 27 段落</p>
      <p>第 28 段落</p>
      <p>第 29 段落</p>
      <p>第 30 段落</p>
      <p>第 31 段落</p>
      <p>第 32 段落</p>
      <p>第 33 段落</p>
      <p>第 34 段落</p>
      <p>第 35 段落</p>
      <p>第 36 段落</p>
      <p>第 37 段落</p>
      <p>第 38 段落</p>
      <p>第 39 段落</p>
      <p>第 40 段落</p>
      <p>第 41 段落</p>
      <p>第 42 段落</p>
      <p>第 43 段落</p>
      <p>第 44 段落</p>
      <p>第 45 段落</p>
      <p>第 46 段落</p>
      <p>第 47 段落</p>
      <p>第 48 段落</p>
      <p>第 49 段落</p>
      <p>第 50 段落</p>
      <p>第 51 段落</p>
      <p>第 52 段落</p>
      <p>第 53 段落</p>
      <p>第 54 段落</p>
      <p>第 55 段落</p>
      <p>第 56 段落</p>
      <p>第 57 段落</p>
      <p>第 58 段落</p>
      <p>第 59 段落</p>
      <p>第 60 段落</p>
      <p>第 61 段落</p>
      <p>第 62 段落</p>
      <p>第 63 段落</p>
      <p>第 64 段落</p>
      <p>第 65 段落</p>
      <p>第 66 段落</p>
      <p>第 67 段落</p>
      <p>第 68 段落</p>
      <p>第 69 段落</p>
      <p>第 70 段落</p>
      <p>第 71 段落</p>
      <p>第 72 段落</p>
      <p>第 73 段落</p>
      <p>第 74 段落</p>
      <p>第 75 段落</p>
      <p>第 76 段落</p>
      <p>第 77 段落</p>
      <p>第 78 段落</p>
      <p>第 79 段落</p>
      <p>第 80 段落</p>
      <p>第 81 段落</p>
      <p>第 82 段落</p>
      <p>第 83 段落</p>
      <p>第 84 段落</p>
      <p>第 85 段落</p>
      <p>第 86 段落</p>
      <p>第 87 段落</p>
      <p>第 88 段落</p>
      <p>第 89 段落</p>
      <p>第 90 段落</p>
      <p>第 91 段落</p>
      <p>第 92 段落</p>
      <p>第 93 段落</p>
      <p>第 94 段落</p>
      <p>第 95 段落</p>
      <p>第 96 段落</p>
      <p>第 97 段落</p>
      <p>第 98 段落</p>
      <p>第 99 段落</p>
      <p>第 100 段落</p>
    </div>
  </div>
</template>

<script>
import FSticky from './components/FSticky.vue';

export default {
  name: 'App',
  components: { FSticky },
};
</script>

<style lang="scss">
@import './assets/_var.scss';
</style>
